top_heights = [6, 9, 5, 7, 4]
#              0  1  2  3  4  5

###################################미해결##################
# 9가 봐.
# 0.6나보다 작아. 아예 없애. 왜??? 만약 나보다 큰 10이 검사한다고 치면, 나보다 작은애는
# 더이상 볼 필요가 없잖아.
# 내가 9인데, 8이 들어오면 내가 젤 크니까 끝.
# 내가 9인데 10이 들어오면 나보다 작은 애들은 볼 필요도 없음.
#
# 6                 0
# 6 9               0
#   9  5            2
#   9  5  7
#   9     7         2
#   9     7  4      4
#
# 6                  0
# 6 9                0
# (6) 9  5              2
# (6) 9  5  7            2
# (6) 9 (5) 7  4          4
#
# 30 15 17 한번 보고, 나보다 작으면 삭제시키면
# 30 (15) 17 24
# 30 (15) (17) 24 26 반복 작업을 할 필요가 없겠구나.
#
# 💡'실전 문제 해결' 팁
# 나중에 이런 문제를 만났을 때 **"스택으로 풀 수 있나?"**를 떠올리는 신호는 이겁니다:
#
# "왼쪽(혹은 오른쪽)에서 나보다 처음으로 큰/작은 놈을 찾아야 할 때"
#
# "중간에 쓸모없어지는 데이터가 생길 때"
#####################################미해결#############################


#
# 1단계
# pop 결과4 현재길이 4 (pop안하고 i를 줄여나가며 반복문으로 풀어도 된다.)
# 7 5 9 6 peek탐색. 현재길이-1에서부터 -1을 하며 인덱스값 구하기.
# 3 2 1 0
# 4보다 큰 값이 있으면 결과리스트의 4에 넣어줌. (5-1)
#
# 2단계
# pop 결과7 현재길이3
# 5 9 6 peek탐색. 현재길이-1에서부터 -1을 하며 인덱스값 구하기.
# 2 1 0
# 7보다 큰 값이 있으면 결과리스트의 3에 넣어줌. (5-2)
# ...
# 5단계
# pop 결과6 현재길이 없음
# 0넣고 종료.


def get_receiver_top_orders(heights):
    result = [0] * (len(heights))
    for i in range(len(heights)-1):
        cur_num = heights.pop()
        cur_len = len(heights)
        for j in range(cur_len-1, -1, -1):
            if heights[j] >= cur_num:
                result[cur_len] = j+1
                break
        else:
            result[cur_len] = 0
    return result

# 강사님 정답 (스택 이용)
# def get_receiver_top_orders(heights):
#     answer = [0] * len(heights)
#     while heights:                              -->for i in range(len(heights)-1)에서 i가 필요없으니
#         height = heights.pop()
#         for idx in range(len(heights) - 1, -1, -1):  --> for i in range(len(heights)-1):
#             if height <= heights[idx]:                    len(heights)-1 부터 1씩 줄여가며 0까지 돌면
#                 answer[len(heights)] = idx + 1            그것은 heights의 인덱스 값으로 활용!
#                 break
#     return answer


# 강사님 정답(반복문 이용)
# def get_receiver_top_orders(heights):
#     answer = [0] * len(heights)
#     for i in range(len(h) - 1, 0, -1):
#         for j in range(i - 1, -1, -1):
#             if heights[i] <= heights[j]:
#                 answer[i] = j + 1
#                 break
#     return answer


print(get_receiver_top_orders(top_heights))  # [0, 0, 2, 2, 4] 가 반환되어야 한다!

print("정답 = [0, 0, 2, 2, 4] / 현재 풀이 값 = ", get_receiver_top_orders([6, 9, 5, 7, 4]))
print("정답 = [0, 0, 2, 3, 3, 3, 6] / 현재 풀이 값 = ", get_receiver_top_orders([3, 9, 9, 3, 5, 7, 2]))
print("정답 = [0, 0, 2, 0, 0, 5, 6] / 현재 풀이 값 = ", get_receiver_top_orders([1, 5, 3, 6, 7, 6, 5]))